CSI API ETABS v1
cLoadCases.GetNameList Method
 Retrieves the names of all defined load cases of the specified type.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameList(
	ref int NumberNames,
	ref string[] MyName,
	eLoadCaseType CaseType =
)
Function GetNameList (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	Optional CaseType As eLoadCaseType =
) As Integer
Dim instance As cLoadCases
Dim NumberNames As Integer
Dim MyName As String()
Dim CaseType As eLoadCaseType
Dim returnValue As Integer
returnValue = instance.GetNameList(NumberNames,
	MyName, CaseType)
int GetNameList(
	int% NumberNames,
	array<String^>^% MyName,
	eLoadCaseType CaseType =
)
abstract GetNameList :
        NumberNames : int byref *
        MyName : string[] byref *
        ?CaseType : eLoadCaseType
(* Defaults:
        let _CaseType = defaultArg CaseType
*)
-> int
Parameters
NumberNames
Type: System.Int32
 The number of load case names retrieved by the program.
MyName
Type: System.String[]
 This is a one-dimensional array of area object names. The MyName array is created as a dynamic, zero-based, array by the API user:
Dim MyName() as String
 The array is dimensioned to (NumberNames – 1) inside the ETABS program, filled with the names, and returned to the API user.
CaseType (Optional)
Type: ETABSv1.eLoadCaseType
Return Value
Type: Int32
 Returns zero if the names are successfully retrieved, otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberNames As Integer
       Dim MyName() As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get load case names
       ret = SapModel.LoadCases.GetNameList(NumberNames, MyName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLoadCases Interface
ETABSv1 Namespace